app/Controllers/Laporan.php

SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` IN ('proses','selesai')
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` = 'tolak'
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` IN ('pinjam','proses')
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` = 'selesai'
---
    public function index()
    {
        $data = [
            'title' => 'Laporan Manajemen',
            'statusPinjamAcc' => $this->PeminjamanModel->whereIn('status', ['proses', 'selesai'])->countAllResults(),
            'statusPinjamTolak' => $this->PeminjamanModel->where('status', 'tolak')->countAllResults(),
            'statusBTPinjam' => $this->PeminjamanModel->whereIn('status', ['pinjam', 'proses'])->countAllResults(),
            'statusBTKembali' => $this->PeminjamanModel->where('status', 'selesai')->countAllResults(),