app/Controllers/Web.php

    public function cariakun(){
        $email = $this->UserModel->where('email', $this->request->getPost('email'))->where('no_hp', $this->request->getPost('no_hp'))->first();
---
SELECT *
FROM `users`
WHERE `email` = 'loket@gmail.com'
AND `no_hp` = '123213'
 LIMIT 1