app/Models/AuthModel.php

INSERT INTO `users` (`nama_user`, `email`, `no_hp`, `password`, `level`, `email_verified`, `email_verification_token`) VALUES ('unduhfileapapun', 'unduhfileapapun@gmail.com', '08123875132', '12345', 'karyawan', 0, '22a8106cc299772c16e9dbd6c359ef5c')
---
    public function save_register($data)
    {
        $this->db->table('users')->insert($data);

SELECT *
FROM `users`
WHERE `email` = 'admin@gmail.com'
AND `password` = '123'
AND `email_verified` = 1
---
    public function login($email, $password)
    {
        return $this->db->table('users')->where([
            'email'     => $email,
            'password'  => $password,
            'email_verified' => 1
        ])
            ->get()
            ->getRowArray();