app/Models/BukuTanahModel.php

SELECT *
FROM `buku_tanah`
JOIN `desa` ON `desa`.`id_desa` = `buku_tanah`.`desa_id`
JOIN `kecamatan` ON `kecamatan`.`id_kecamatan` = `desa`.`kecamatan_id`
---
    public function getBukutanah($id = false)
    {
        if ($id == false) {
            return $this
            ->join('desa', 'desa.id_desa = buku_tanah.desa_id')
            ->join('kecamatan', 'kecamatan.id_kecamatan = desa.kecamatan_id')
            ->findAll();