app/Models/DesaModel.php

SELECT *
FROM `desa`
JOIN `kecamatan` ON `kecamatan`.`id_kecamatan` = `desa`.`kecamatan_id`
---
    public function getDesa($id_desa = false)
    {
        if ($id_desa == false) {
            return $this
            ->join('kecamatan', 'kecamatan.id_kecamatan = desa.kecamatan_id')
            ->findAll();