app/Models/PeminjamanModel.php

    public function getPeminjaman($id = false)
    {
        $query = $this
            ->select('peminjaman.*, peminjaman.id_peminjaman as id_peminjaman, users.nama_user, users.nip, users.bagian, buku_tanah.kode_buku, desa.nama_desa, kecamatan.nama_kecamatan')
            ->join('users', 'users.id_user = peminjaman.user_id', 'left')
            ->join('buku_tanah', 'buku_tanah.id_buku_tanah = peminjaman.buku_tanah_id', 'left')
            ->join('desa', 'desa.id_desa = buku_tanah.desa_id', 'left')
            ->join('kecamatan', 'kecamatan.id_kecamatan = desa.kecamatan_id', 'left');

        if ($id !== false) {
            $query->where('peminjaman.id_peminjaman', $id);
        }

        if (session()->get('level') == "karyawan") {
            $query->where('user_id', session()->get('id_user'));
        }

        return $query->findAll();
---
SELECT `peminjaman`.*, `peminjaman`.`id_peminjaman` as `id_peminjaman`, `users`.`nama_user`, `users`.`nip`, `users`.`bagian`, `buku_tanah`.`kode_buku`, `desa`.`nama_desa`, `kecamatan`.`nama_kecamatan`
FROM `peminjaman`
LEFT JOIN `users` ON `users`.`id_user` = `peminjaman`.`user_id`
LEFT JOIN `buku_tanah` ON `buku_tanah`.`id_buku_tanah` = `peminjaman`.`buku_tanah_id`
LEFT JOIN `desa` ON `desa`.`id_desa` = `buku_tanah`.`desa_id`
LEFT JOIN `kecamatan` ON `kecamatan`.`id_kecamatan` = `desa`.`kecamatan_id`
WHERE `peminjaman`.`id_peminjaman` = '1'
AND `user_id` = '5'

    public function getPeminjamanWhereStatus($status = "All")
    {
        $query = $this
            ->select('peminjaman.*, peminjaman.id_peminjaman as id_peminjaman, users.nama_user, users.nip, users.bagian, buku_tanah.kode_buku, desa.nama_desa, kecamatan.nama_kecamatan')
            ->join('users', 'users.id_user = peminjaman.user_id', 'left')
            ->join('buku_tanah', 'buku_tanah.id_buku_tanah = peminjaman.buku_tanah_id', 'left')
            ->join('desa', 'desa.id_desa = buku_tanah.desa_id', 'left')
            ->join('kecamatan', 'kecamatan.id_kecamatan = desa.kecamatan_id', 'left')
            ->orderBy('peminjaman.tanggal_peminjaman', 'DESC');

        if ($status !== "All") {
            $query->where('peminjaman.status', $status);
        }

        if (session()->get('level') == "karyawan") {
            $query->where('user_id', session()->get('id_user'));
        }

        return $query->findAll();
---
SELECT `peminjaman`.*, `peminjaman`.`id_peminjaman` as `id_peminjaman`, `users`.`nama_user`, `users`.`nip`, `users`.`bagian`, `buku_tanah`.`kode_buku`, `desa`.`nama_desa`, `kecamatan`.`nama_kecamatan`
FROM `peminjaman`
LEFT JOIN `users` ON `users`.`id_user` = `peminjaman`.`user_id`
LEFT JOIN `buku_tanah` ON `buku_tanah`.`id_buku_tanah` = `peminjaman`.`buku_tanah_id`
LEFT JOIN `desa` ON `desa`.`id_desa` = `buku_tanah`.`desa_id`
LEFT JOIN `kecamatan` ON `kecamatan`.`id_kecamatan` = `desa`.`kecamatan_id`
SELECT `peminjaman`.*, `peminjaman`.`id_peminjaman` as `id_peminjaman`, `users`.`nama_user`, `users`.`nip`, `users`.`bagian`, `buku_tanah`.`kode_buku`, `desa`.`nama_desa`, `kecamatan`.`nama_kecamatan`
FROM `peminjaman`
LEFT JOIN `users` ON `users`.`id_user` = `peminjaman`.`user_id`
LEFT JOIN `buku_tanah` ON `buku_tanah`.`id_buku_tanah` = `peminjaman`.`buku_tanah_id`
LEFT JOIN `desa` ON `desa`.`id_desa` = `buku_tanah`.`desa_id`
LEFT JOIN `kecamatan` ON `kecamatan`.`id_kecamatan` = `desa`.`kecamatan_id`
WHERE `peminjaman`.`status` = 'selesai'
SELECT `peminjaman`.*, `peminjaman`.`id_peminjaman` as `id_peminjaman`, `users`.`nama_user`, `users`.`nip`, `users`.`bagian`, `buku_tanah`.`kode_buku`, `desa`.`nama_desa`, `kecamatan`.`nama_kecamatan`
FROM `peminjaman`
LEFT JOIN `users` ON `users`.`id_user` = `peminjaman`.`user_id`
LEFT JOIN `buku_tanah` ON `buku_tanah`.`id_buku_tanah` = `peminjaman`.`buku_tanah_id`
LEFT JOIN `desa` ON `desa`.`id_desa` = `buku_tanah`.`desa_id`
LEFT JOIN `kecamatan` ON `kecamatan`.`id_kecamatan` = `desa`.`kecamatan_id`
WHERE `peminjaman`.`status` = 'tolak'

    public function getLaporanPeminjaman($tgl_awal = false, $tgl_akhir = false, $user_id = false){
        $query = $this
        ->select('peminjaman.*, peminjaman.id_peminjaman as id_peminjaman, users.nama_user, users.nip, users.bagian, buku_tanah.kode_buku, desa.nama_desa, kecamatan.nama_kecamatan')
        ->join('users', 'users.id_user = peminjaman.user_id', 'left')
        ->join('buku_tanah', 'buku_tanah.id_buku_tanah = peminjaman.buku_tanah_id', 'left')
        ->join('desa', 'desa.id_desa = buku_tanah.desa_id', 'left')
        ->join('kecamatan', 'kecamatan.id_kecamatan = desa.kecamatan_id', 'left');

    if($user_id !== "All"){
        $query->where('user_id', $user_id);
    }
    if ($tgl_awal !== false AND $tgl_akhir !== false) {
        $query
        ->where('tanggal_peminjaman >=', $tgl_awal)
        ->where('tanggal_peminjaman <=', $tgl_akhir);
    }

    return $query->findAll();
---
SELECT `peminjaman`.*, `peminjaman`.`id_peminjaman` as `id_peminjaman`, `users`.`nama_user`, `users`.`nip`, `users`.`bagian`, `buku_tanah`.`kode_buku`, `desa`.`nama_desa`, `kecamatan`.`nama_kecamatan`
FROM `peminjaman`
LEFT JOIN `users` ON `users`.`id_user` = `peminjaman`.`user_id`
LEFT JOIN `buku_tanah` ON `buku_tanah`.`id_buku_tanah` = `peminjaman`.`buku_tanah_id`
LEFT JOIN `desa` ON `desa`.`id_desa` = `buku_tanah`.`desa_id`
LEFT JOIN `kecamatan` ON `kecamatan`.`id_kecamatan` = `desa`.`kecamatan_id`
WHERE `tanggal_peminjaman` >= '2024-11-01'
AND `tanggal_peminjaman` <= '2024-11-30'