app/Models/SettingModel.php

SELECT *
FROM `setting`
WHERE `id_setting` = '1'
---
    public function detailSetting()
    {
        return $this->db->table('setting')
            ->where('id_setting', '1')
            ->get()->getRowArray();