app/Models/UserModel.php

    public function getUser()
    {
        return $this->db->table('users')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `users`